/*
 * @ClassName: Exam_1
 * @Description:
 * @Author: Caozs
 * @Created: 2021/4/7 4:55 下午
 * @Version: 1.0
 * 精确表达浮点数
详细描述
有限小数或者无限循环小数都可以转化为分数。

比如：0.9=9/10 0.333(3)=1/3（括号中的数字表示是循环节）

当然一个小数可以用好几种分数形式来表示。如：0.333(3)=1/3=3/9 给定一个有限小数或无限循环小数，你能否以分母最小的分数形式来返回这个小数呢？如果输入为循环小数，循环节用括号标记出来。

其他
时间限制: 1000ms

内存限制: 256.0MB

输入输出描述
输入描述
大于0小于1的有限小数或者大于0小于1的无限循环小数

比如 0.214

比如 0.543(33) 代表的是0.54333333...无限循环

输出描述
一个分数的表达式，比如

1/3

1/2

13/89

输入输出示例
示例1
输入
复制
0.3(333)
输出
复制
1/3
示例2
输入
复制
0. 285714(285714)
输出
复制
2/7
 */
public class Exam_1 {
}
